In [1]:
from db_util import get_db
db = get_db()
cursor = db.cursor()

In [10]:
# DB 생성 쿼리
create_db_query = """
CREATE DATABASE IF NOT EXISTS student_mgmt;
"""
cursor.execute(create_db_query)

# DB 사용 쿼리
use_db_query = """
USE student_mgmt;
"""
cursor.execute(use_db_query)

# 테이블 삭제 쿼리
drop_table_query = """
DROP TABLE IF EXISTS students;
"""
cursor.execute(drop_table_query)

# 테이블 생성 쿼리
create_table_query = """
CREATE TABLE students (
id TINYINT NOT NULL AUTO_INCREMENT,
name VARCHAR(10) NOT NULL,
gender ENUM('man','woman') NOT NULL,
birth DATE NOT NULL,
english TINYINT NOT NULL,
math TINYINT NOT NULL,
korean TINYINT NOT NULL,
PRIMARY KEY (id)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
"""

cursor.execute(create_table_query)

0

In [11]:
# 1. 실행할 쿼리 틀 작성 (데이터 자리는 %s로 비워둠)
sql = "INSERT INTO students (name, gender, birth, english, math, korean) VALUES (%s, %s, %s, %s, %s, %s)"

# 2. 데이터는 리스트 내 튜플 형태로 준비
data = [
    ('dave', 'man', '1983-07-16', 90, 80, 71),
    ('minsun', 'woman', '1982-10-16', 30, 88, 60),
    ('david', 'man', '1982-12-10', 78, 77, 30),
    ('jade', 'man', '1979-11-01', 45, 66, 20),
    ('jane', 'man', '1990-11-12', 65, 32, 90),
    ('wage', 'woman', '1982-1-13', 76, 30, 80),
    ('tina', 'woman', '1982-12-3', 87, 62, 71)
]

try:
    # with db.cursor() as cursor:
    #     # 3. executemany로 한 번에 실행
    #     cursor.executemany(sql, data)
    cursor = db.cursor()
    cursor.executemany(sql, data)
    db.commit()  # 4. 실제 DB에 반영
    print(f"{cursor.rowcount} rows inserted.")
finally:
    db.close()

7 rows inserted.